#+begin_src emacs-lisp :tangle no

(setq display-buffer-alist
      `((,(rx bos "*R")
         (display-buffer-reuse-window display-buffer-at-bottom)
         (window-width . 0.5)
         (reusable-frames . nil))))

#+end_src


#+begin_src emacs-lisp :tangle no

(setq display-buffer-alist
      `(("R Graphics: Device 2 (ACTIVE)"
           (display-buffer-reuse-window display-buffer-in-side-window)
           (side . right)
           (slot . -1)
           (window-width . 0.5)
           (reusable-frames . nil))
         (,(rx bos "*R")
         (display-buffer-reuse-window display-buffer-at-bottom)
         (window-width . 0.5)
         (reusable-frames . nil))))

#+end_src


#+RESULTS:
| R Graphics: Device 2 (ACTIVE) | (display-buffer-reuse-window display-buffer-in-side-window) | (side . right)       | (slot . -1)       | (window-width . 0.5) | (reusable-frames) |
| \`\*R                         | (display-buffer-reuse-window display-buffer-at-bottom)      | (window-width . 0.5) | (reusable-frames) |                      |                   |

#+begin_src emacs-lisp :tangle no

  (setq display-buffer-alist
        `(("R_x11"
           (display-buffer-reuse-window display-buffer-in-side-window)
           (side . right)
           (slot . -1)
           (window-width . 0.5)
           (reusable-frames . nil))
          ("*R"
           (display-buffer-reuse-window display-buffer-at-bottom)
           (window-width . 0.5)
           (reusable-frames . nil))
          ("*Help"
           (display-buffer-reuse-window display-buffer-in-side-window)
           (side . right)
           (slot . 1)
           (window-width . 0.5)
           (reusable-frames . nil))))

#+end_src

#+RESULTS:
| R_x11 | (display-buffer-reuse-window display-buffer-in-side-window) | (side . right)       | (slot . -1)       | (window-width . 0.5) | (reusable-frames) |
| *R    | (display-buffer-reuse-window display-buffer-at-bottom)      | (window-width . 0.5) | (reusable-frames) |                      |                   |
| *Help | (display-buffer-reuse-window display-buffer-in-side-window) | (side . right)       | (slot . 1)        | (window-width . 0.5) | (reusable-frames) |


#+begin_src emacs-lisp :tangle no

  (setq display-buffer-alist
        `(("R_x11"
           (display-buffer-reuse-window display-buffer-in-side-window)
           (side . right)
           (slot . -1)
           (window-width . 0.5)
           (reusable-frames . nil))
          ("*R"
           (display-buffer-reuse-window display-buffer-at-bottom)
           (window-width . 0.5)
           (reusable-frames . nil))))

#+end_src

#+RESULTS:
| R_x11 | (display-buffer-reuse-window display-buffer-in-side-window) | (side . right)       | (slot . -1)       | (window-width . 0.5) | (reusable-frames) |
| *R    | (display-buffer-reuse-window display-buffer-at-bottom)      | (window-width . 0.5) | (reusable-frames) |                      |                   |


